# 1. С какого "фундамента" начинаем (берем готовую ОС с установленным Python)
FROM python:3.10-slim

# 2. Создаем папку внутри этого "мини-компьютера", где будет лежать код
WORKDIR /app

# 3. Копируем файл со списком библиотек из твоего компа в контейнер
COPY requirements.txt .

# 4. Выполняем команду установки этих библиотек внутри контейнера
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем вообще все остальные файлы проекта (код, картинки, стили)
COPY . .

# 6. Какой порт "открыть", чтобы мы могли зайти на сайт (например, 8000)
EXPOSE 8000

# 7. Главная команда: что запустить при старте контейнера
CMD ["python", "main.py"]